// PH定制-----------------------------------------------------------------------------------------------------------------------
(function() {
  // 基于准备好的dom，初始化echarts实例
  var myChart = echarts.init(document.querySelector(".bar1 .chart"));

  option = {
    
  backgroundColor:'#FFFFFF00',
  grid: {
    left: '1%',
    right: '1%',
    top: '10%',
    bottom: '10%',
    containLabel: true
  },
  xAxis: {
    type: 'category',
    boundaryGap: 1,
    axisLine: {
      lineStyle: {
        color: '#ffffff80' //x轴的颜色
      }
    },
    axisTick: {
      show: false, // 隐藏x轴刻度线
      alignWithLabel: true
    },
    axisLabel: {
      color: '#C5D6E6'
    },
    data: ['样点1','样点2','样点3', '样点4','样点5','样点6','样点7','样点8','样点9','样点10','样点11','样点12','样点13','样点14',
    '样点15','样点16','样点17','样点18','样点19','样点20','样点21','样点22','样点23','样点24','样点25','样点26','样点27','样点28',
    '样点29','样点30','样点31','样点32','样点33','样点34','样点35','样点36','样点37','样点38','样点39','样点40','样点41','样点42',
    '样点43','样点44','样点45','样点46','样点47','样点48','样点49', '样点50','样点50','样点51','样点52','样点53', '样点54','样点55',
    '样点56','样点57','样点58','样点59','样点60','样点61','样点62','样点63', '样点64','样点65','样点66','样点67','样点68','样点69',
    '样点70','样点71','样点72','样点73', '样点74','样点75','样点76','样点77','样点78','样点79','样点80','样点81','样点82']
  },
  yAxis: [
    {
      type: 'value',
      name: '',
      min: 0,
      splitLine: {
        lineStyle: {
          color: '#ffffff1a',
          type: 'dashed'
        }
      },
      axisLabel: {
        show: true,
        margin: 10,
        color: '#C5D6E6' //y轴字体颜色
      },
      axisTick: {
        alignWithLabel: true
      }
    }
  ],
  series: [
    {
      data: [7.580,7.64,8.12,7.98,7.99,7.880,8.310,8.15,7.33,7.34,7.17,6.93,8.29,8.36,8.37,6.6,7.02,7.25,7.49,7.56,7.49,
        8.14,8.73,8.64,7.6,7.2,7.24,7.53,7.44,7.5,7.2,7.3,7.1,7.3,7.2,7.3,6.8,7.1,7.88,7.9,7.85,7.84,7.88,7.72,7.5,7.4,7.4,
        7.33,7.37,7.42,7.54,7.38,7.87,7.84,7.85,7.78,7.11,7.14,7.1,7.44,7.88,7.66,7.9,7.89,7.14,7.14,7.14,7.61,7.75,7.84,
        8.04,7.66,7.75,9.15,7.94,8.99,8.4,8.78,7.4,7.8,7.54,7.67],
      type: 'pictorialBar',
      showBackground: true,
      label: {
        show: false,
        position: 'top',
        color: '#5797FF'
      },
      backgroundStyle: {
        color: 'rgba(255, 255, 255, 0.03)'
      },
      barCategoryGap: '40%',
      // https://echarts.apache.org/zh/option.html#series-pictorialBar.symbol
      symbol: 'triangle',
      itemStyle: {
        normal: {
          color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
            {
              offset: 0,
              color: '#5797FF'
            },
            {
              offset: 1,
              color: '#e7c59c'
            }
          ])
        }
      },
      emphasis: {
        itemStyle: {
          color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
            {
              offset: 0,
              color: '#D2FF77'
            },
            {
              offset: 1,
              color: 'rgba(210,255,119,0)'
            }
          ]), // 鼠标滑过时柱状图的颜色
          opacity: 1 // 鼠标滑过时柱状图的透明度
        },
        label: {
          show: true, // 鼠标滑过时是否显示标签
            trigger: "axis",
            axisPointer: {
              // 坐标轴指示器，坐标轴触发有效
              type: "shadow" // 默认为直线，可选为：'line' | 'shadow'
            },
          textStyle: {
            color: '#D2FF77', // 鼠标滑过时柱状图的颜色
            opacity: 1 // 鼠标滑过时柱状图的透明度
          }
        }
      }
    },
    {
      
      itemStyle: {
        normal: {
          color: 'rgba(255, 255, 255, 0.08)'
        }
      },
      data: [0.35],
      z: '-99'
    },
    
   
  ]
}
  myChart.setOption(option);
  window.addEventListener("resize", function() {
    myChart.resize();
  });
    
})();

// 柱状图4模块----------------------------------------------------------------------------------------------------
(function() {
  // 实例化对象
  var myChart = echarts.init(document.querySelector(".bar4 .chart"));
  // 指定配置和数据
  var option = {
    color: ["#2f89cf"],
   tooltip: {
      trigger: "axis",
      axisPointer: {
        // 坐标轴指示器，坐标轴触发有效
        type: "shadow" // 默认为直线，可选为：'line' | 'shadow'
      }
    },
    grid: {
      left: "0%",
      top: "10px",
      right: "0%",
      bottom: "4%",
      containLabel: true
    },
      xAxis: {
        type: 'category',
        data: [
          '样点1','样点2','样点3', '样点4','样点5','样点6','样点7','样点8','样点9','样点10','样点11','样点12','样点13','样点14',
        '样点15','样点16','样点17','样点18','样点19','样点20','样点21','样点22','样点23','样点24','样点25','样点26','样点27','样点28',
        '样点29','样点30','样点31','样点32','样点33','样点34','样点35','样点36','样点37','样点38','样点39','样点40','样点41','样点42',
        '样点43','样点44','样点45','样点46','样点47','样点48','样点49', '样点50','样点50','样点51','样点52','样点53', '样点54','样点55',
        '样点56','样点57','样点58','样点59','样点60','样点61','样点62','样点63', '样点64','样点65','样点66','样点67','样点68','样点69',
        '样点70','样点71','样点72','样点73', '样点74','样点75','样点76','样点77','样点78','样点79','样点80','样点81','样点82'
        ],
        axisTick: {
          alignWithLabel: true
        },
        axisLabel: {
          textStyle: {
            color: "rgba(255,255,255,.6)",
            fontSize: "12"
          }
        },
        axisLine: {
          show: false
        }
      },
      yAxis: {
        type: 'value'
      },
      series: [
        {
          data: [26.3,8.4,33.1,41.3,40.2,1.8,5.5,3.2,27,23.3,29.3,6.5,143.6,143,142.9,0.7,3.3,10.8,0.5,
            0.3,1.2,150.6,154.1,150,27.8,12.4,4.8,0.6,0.3,2.1,3.5,2.6,16.4,20.7,21.6,6.7,11.1,23.5,2.4,
            1.8,2,3.6,6,4.9,5.1,19.5,8.7,0.6,0.4,1.7,0.9,0.3,0.2,16.5,4.6,0.2,0.1,0.3,0,0,0.2,0.1,0.2,
            0.3,0.1,0.4,0.2,0.1,2.2,2.3,4.9,11.8,3.1,0.8,0.2,147.5,154.5,144.4,13.4,15,0.7,0.8    
          ],
          type: 'bar'
        }
      ]
    };
    
     myChart.setOption(option);
     window.addEventListener("resize", function() {
      myChart.resize();
    });
})();

// 高锰酸钾定制--------------------------------------------------------------------------------------------------------------------------
(function() {
  // 基于准备好的dom，初始化echarts实例
  var myChart = echarts.init(document.querySelector(".bar3 .chart"));

  // (1)准备数据
  

  // 2. 指定配置和数据
  var option = {
    color: ["#97cbff"],
    tooltip: {
      // 通过坐标轴来触发
      trigger: "axis"
    },
    legend: {
      // 距离容器10%
      right: "10%",
      // 修饰图例文字的颜色
      textStyle: {
        color: "#4c9bfd"
      }
      // 如果series 里面设置了name，此时图例组件的data可以省略
      // data: ["邮件营销", "联盟广告"]
    },
    grid: {
      top: "5%",
      left: "3%",
      right: "4%",
      bottom: "3%",
      show: true,
      borderColor: "#012f4a",
      containLabel: true
    },
  
      tooltip: {
        trigger: 'axis',
        axisPointer: {
          type: 'shadow'
        }
      },
    
      xAxis: {
        type: 'value',
        boundaryGap: [0, 0.01]
      },
      yAxis: {
        type: 'category',
        data: ['样点1','样点2','样点3', '样点4','样点5','样点6','样点7','样点8','样点9','样点10','样点11','样点12','样点13','样点14',
        '样点15','样点16','样点17','样点18','样点19','样点20','样点21','样点22','样点23','样点24','样点25','样点26','样点27','样点28',
        '样点29','样点30','样点31','样点32','样点33','样点34','样点35','样点36','样点37','样点38','样点39','样点40','样点41','样点42',
        '样点43','样点44','样点45','样点46','样点47','样点48','样点49', '样点50','样点50','样点51','样点52','样点53', '样点54','样点55',
        '样点56','样点57','样点58','样点59','样点60','样点61','样点62','样点63', '样点64','样点65','样点66','样点67','样点68','样点69',
        '样点70','样点71','样点72','样点73', '样点74','样点75','样点76','样点77','样点78','样点79','样点80','样点81','样点82' ]
      },
      series: [
        {
          type: 'bar',
          data: [4.38,2.84,2.67,2.67,3.01,4.29,2.84,2.73,4.3,4.3,3.98,4.77,3.49,3.60 ,3.43,1.93, 4.69,4,3.510,2.6,5,2.95,5.87,
            4.54,4.32,2.92,0.92,2.72,2.56,1.77,1.07,0.98,1.03,2.68,1.98,6.38,4.75,3.12,1.2,3.77,3.56,4.32,3.82,3.43,4.30,2.73,
            5.64,2.73,5.24,3.98,4.45,3.34,3.05,3.05,3.36,3.52,1.76,3.81,4.55,3.65,2.76,3.43,2.29,3.51,2.57,2.48,4.19,4.51,3.76,
            3.85,4.18,2.84,3.65,4.18,4.2,2.19,4.27,4.38,4.11,1.04,1.99,2.26,4.48]
        },
      ]  
  };
  
  // 重新把配置好的新数据给实例对象
  myChart.setOption(option);
  window.addEventListener("resize", function() {
    myChart.resize();
  });
})();

// TOC 和  叶绿素 定制-------------------------------------------------------------------------------------------------------------------------
(function() {
  // 实例化对象
  var myChart = echarts.init(document.querySelector(".bar2 .chart"));
  // 指定配置和数据
  var option;

  option = {
    tooltip: {
      trigger: 'axis'
    },
    legend: {
      data: ['TOC', '叶绿素a（ug/ml）'],
      textStyle: {
        color: "rgba(255,255,255,.5)",
        fontSize: "12"
      },      
    },
    grid: {
      left: '0%',
      right: '0%',
      top:'15%',
      bottom: '3%',
      containLabel: true
    },
    xAxis: {
      type: 'category',
      boundaryGap: false,
      data: [
        '样点1','样点2','样点3', '样点4','样点5','样点6','样点7','样点8','样点9','样点10','样点11','样点12','样点13','样点14',
      '样点15','样点16','样点17','样点18','样点19','样点20','样点21','样点22','样点23','样点24','样点25','样点26','样点27','样点28',
      '样点29','样点30','样点31','样点32','样点33','样点34','样点35','样点36','样点37','样点38','样点39','样点40','样点41','样点42',
      '样点43','样点44','样点45','样点46','样点47','样点48','样点49', '样点50','样点50','样点51','样点52','样点53', '样点54','样点55',
      '样点56','样点57','样点58','样点59','样点60','样点61','样点62','样点63', '样点64','样点65','样点66','样点67','样点68','样点69',
      '样点70','样点71','样点72','样点73', '样点74','样点75','样点76','样点77','样点78','样点79','样点80','样点81','样点82' 
      ]
    },
    yAxis: {
      type: 'value'
    },
    series: [
      {
        name: 'TOC',
        type: 'line',
        stack: 'Total',
        data: [
          5.05, 3.36, 5.4, 5.44, 2.78, 6.61, 4.79, 5.06, 7.66, 4.19, 3.95, 3.54,
          2.84, 2.67, 2.43, 1.77, 7.63, 3.55, 3.97, 3.46, 3.8, 3.92, 4.01, 3.82,
          4.27, 1.61, 2.4, 5.78, 1.85, 2.17, 1.66, 2.16, 4.57, 4, 8.35, 6.35,
          4.92, 2.89, 1.35, 1.76, 2.15, 3.4, 3.27, 3.81, 4.89, 7.81, 4.98, 8.75,
          10.28, 10.61, 3.9, 3.56, 3.45, 4.57, 3.0, 3.23, 4.24, 4.89, 3.66, 3.24,
          3.57, 3.3, 3.52, 3.02, 3.03, 4.57, 4.68, 3.76, 1.55, 3.34, 1.79, 6.33,
          4.18, 6.56, 3.01, 4.91, 3.94, 3.61, 2.69, 3.66, 3.49, 3.83 ]
      },
  
      {
        name: '叶绿素a（ug/ml）',
        type: 'line',
        stack: 'Total',
        data: [
          1.926, 2.03, 3.04, 0.31, 1.12, 2.874, 2.122, 1.164, 3.91, 3.15, 2.82,
          1.91, 6.35, 5.69, 5.58, 0.05, 3.13, 2.29, 10.14, 5.17, 10.14, 5.79,
          5.14, 4.94, 0.42, 0.32, 1.92, 3.87, 0.42, 2.6, 0.35, 1.2, 5.7, 5.02,
          5.1, 2.7, 2.3, 5.6, 6.32, 5.84, 4.96, 1.94, 1.73, 2.12, 5.4, 5.55, 5.72,
          2.19, 1.89, 2.02, 12.37, 0.31, 0.5, 2.08, 2, 1.66, 1.908, 0.94, 0.68,
          0.79, 2.59, 0.62, 2.78, 0.53, 0.8, 0.87, 1.13, 0.9, 9.87, 7.11, 4.41,
          5.21, 2.122, 0.968, 1.926, 1.04, 4.26, 4.74, 4.97, 5.2, 2.3, 5.63, 14.09
        ]
      }
    ]
  };
  
  option && myChart.setOption(option);
     window.addEventListener("resize", function() {
      myChart.resize();
    });
})();

// 中下图定制-------------------------------------------------------------------------------------------------------------------------
(function() {
  // 实例化对象
  var myChart = echarts.init(document.querySelector(".bar7 .chart"));
  // 指定配置和数据
var option;

option = {
  grid: {
    left: "0%",
    top: "30px",
    right: "0%",
    bottom: "2%",
    containLabel: true
  },
  tooltip: {
    trigger: 'axis',
    axisPointer: {
      type: 'cross',
    }
  },
 
  legend: {
    textStyle: {
      color: "rgba(255,255,255,.5)",
      fontSize: "12"
    },
    data: ['总磷(mg/L)', '氨氮（mg/L)', '总氮（mg/L）']
  },
  xAxis: [
    {
      type: 'category',
      data: ['样点1','样点2','样点3', '样点4','样点5','样点6','样点7','样点8','样点9','样点10','样点11','样点12','样点13','样点14',
      '样点15','样点16','样点17','样点18','样点19','样点20','样点21','样点22','样点23','样点24','样点25','样点26','样点27','样点28',
      '样点29','样点30','样点31','样点32','样点33','样点34','样点35','样点36','样点37','样点38','样点39','样点40','样点41','样点42',
      '样点43','样点44','样点45','样点46','样点47','样点48','样点49', '样点50','样点50','样点51','样点52','样点53', '样点54','样点55',
      '样点56','样点57','样点58','样点59','样点60','样点61','样点62','样点63', '样点64','样点65','样点66','样点67','样点68','样点69',
      '样点70','样点71','样点72','样点73', '样点74','样点75','样点76','样点77','样点78','样点79','样点80','样点81','样点82'  ],
      axisPointer: {
        type: 'shadow',
       
      }
    }
  ],
  yAxis: [
    {
      type: 'value',
      axisLabel: {
        formatter: '{value}mg/L'
      }
    },
    {
      type: 'value',
      min: 0,
      max: 5.5,
      interval: 6,
      axisLabel: {
        formatter: '{value}mg/L'
      }
    }
  ],
  series: [
    {
      name: '总磷(mg/L)',
      type: 'bar',
      tooltip: {
        valueFormatter: function (value) {
          return value + ' mg/L';
        }
      },
      data: [
        0.08, 0.013, 0.025, 0.017, 0.014, 0.036, 0.033, 0.021, 0.078, 0.021,
        0.126, 0.104, 0.151, 0.152, 0.154, 0.107, 0.096, 0.1, 0.047, 0.035,
        0.039, 0.043, 0.049, 0.018, 0.004, 0.003, 0.109, 0.074, 0.079, 0.016,
        0.003, 0.008, 0.035, 0.023, 0.017, 0.016, 0.013, 0.039, 0.026, 0.03,
        0.036, 0.079, 0.083, 0.089, 0.026, 0.318, 0.02, 0.032, 0.104, 0.023,
        0.047, 0.019, 0.008, 0.03, 0.026, 0.032, 0.043, 0.144, 0.082, 0.012,
        0.109, 0.008, 0.113, 0.012, 0.012, 0.058, 0.148, 0.097, 0.026, 0.051,
        0.047, 0.073, 0.069, 0.023, 0.012, 0.022, 0.029, 0.06, 0.032, 0.001,
        0.023, 0.058
      ]
    },
    {
      name: '氨氮（mg/L)',
      type: 'bar',
      tooltip: {
        valueFormatter: function (value) {
          return value + ' mg/L';
        }
      },
      data: [
        0.2730772, 0.064896, 0.117307, 0.080311, 0.055647, 0.051524, 0.0798622,
        0.1185052, 0.245, 0.198, 0.146, 0.985, 0.9583464, 0.9738036, 0.4482588,
        0.754, 0.185, 0.535, 0.3186663, 0.1823409, 0.1505036, 0.7367932,
        0.7110312, 0.4353778, 0.1256, 0.1408, 0.294, 0.263, 0.966, 0.0883,
        0.0759, 0.0518, 0.0942, 0.0262, 0.1239, 0.0292, 0.0653, 0.0894,
        0.115929, 0.0180334, 0.0309144, 0.207, 0.217, 0.248, 0.046, 0.0473,
        0.043, 0.483, 0.195, 0.162, 0.3370393, 1.1200941, 0.7119978, 0.0669812,
        0.0618288, 0.0334906, 0.1823409, 1.9031489, 0.1128777, 0.3254621,
        0.4515108, 0.3128777, 0.4575927, 0.1220974, 0.1210238, 0.1244549,
        1.9520587, 0.1128777, 0.1210814, 0.038643, 0.025762, 0.2498914,
        0.0592526, 0.1494196, 0.0723575, 0.4611398, 0.528121, 0.8578746, 0.0747,
        0.0958, 0.2373326, 0.2402269
      ]
    },
    {
      name: '总氮（mg/L）',
      type: 'line',
      yAxisIndex: 1,
      tooltip: {
        valueFormatter: function (value) {
          return value + ' mg/L';
        }
      },
      data: [
        1.44, 1.63, 0.79, 0.66, 0.66, 1.8, 1.39, 2.06, 1.43, 1.32, 1.65, 1.8,
        1.66, 1.68, 1.69, 2.32, 0.97, 1.97, 1.84, 3.28, 1.76, 1.41, 1.44, 1.36,
        1.38, 1.32, 1.56, 0.96, 1.43, 0.9, 1.29, 1.1, 1.1, 1, 1.21, 1.01, 1.19,
        1.14, 1.73, 1.51, 1.59, 0.37, 0.38, 0.63, 1.29, 1.26, 1.28, 1.22, 1.37,
        1.24, 1.8, 4.54, 4.11, 3.65, 4.14, 3.95, 3.49, 4.63, 5.09, 1.23, 3.97,
        1.21, 3.93, 2.87, 2.79, 3.35, 4.56, 4.75, 1.87, 1.69, 1.54, 1.89, 2.32,
        1.62, 3.52, 1.3, 1.24, 1.28, 0.84, 1.48, 3.52, 1.51
      ]
    }
  ]
};

option && myChart.setOption(option);
     window.addEventListener("resize", function() {
      myChart.resize();
    });
})();


// 学习进度柱状图模块-----------------------------------------------------------------------------------------------------
(function() {
  // 基于准备好的dom，初始化echarts实例
  var myChart = echarts.init(document.querySelector(".bar5 .chart"));


var option;

option = {
  grid: {
    left: "0%",
    top: "30px",
    right: "0%",
    bottom: "2%",
    containLabel: true
  },
  tooltip: {
    trigger: 'axis'
  },
  legend: {
    textStyle: {
      color: "rgba(255,255,255,.5)",
      fontSize: "12"
    }
  },
  
  xAxis: {
    type: 'category',
    boundaryGap: false,
    data: [
      '样点1','样点2','样点3', '样点4','样点5','样点6','样点7','样点8','样点9','样点10','样点11','样点12','样点13','样点14',
      '样点15','样点16','样点17','样点18','样点19','样点20','样点21','样点22','样点23','样点24','样点25','样点26','样点27','样点28',
      '样点29','样点30','样点31','样点32','样点33','样点34','样点35','样点36','样点37','样点38','样点39','样点40','样点41','样点42',
      '样点43','样点44','样点45','样点46','样点47','样点48','样点49', '样点50','样点50','样点51','样点52','样点53', '样点54','样点55',
      '样点56','样点57','样点58','样点59','样点60','样点61','样点62','样点63', '样点64','样点65','样点66','样点67','样点68','样点69',
      '样点70','样点71','样点72','样点73', '样点74','样点75','样点76','样点77','样点78','样点79','样点80','样点81','样点82' 
    ]
  },
  yAxis: {
    type: 'value',
    axisLabel: {
      formatter: '{value} mg/L'
    }
  },
  series: [
    {
      name: '硝态氮（mg/L）',
      type: 'line',
      data: [
        1.174799, 1.2889206, 0.5538429, 0.4944888, 0.3803463, 1.4559804,
        1.0361342, 1.2826494, 1.29, 1.187, 1.323, 1.368, 1.0053198, 1.0939112,
        1.0746522, 1.151, 0.44, 1.426, 1.335375716, 2.726165, 1.2372595,
        0.8204334, 0.7742118, 0.8050262, 1.2263, 1.1489, 0.933, 0.613, 1.003,
        0.7791, 1.1869, 1.0219, 0.9775, 0.9411, 1.0529, 0.9521, 1.0947, 1.0172,
        1.4598322, 1.3365746, 1.3327228, 0.231, 0.264, 0.325, 1.2134, 1.1875,
        1.2031, 0.982, 1.22, 1.237, 1.2750064, 3.1413809, 3.2252629, 3.293289,
        3.3433624, 3.3241034, 2.3319196, 1.8412099, 3.5062676, 0.6249209,
        3.2755921, 0.6039504, 3.245575, 2.3948311, 2.4409662, 2.222873,
        1.8244335, 3.439162, 1.367389, 1.3635372, 1.3904998, 1.174799,
        2.0106396, 0.9513946, 3.1246045, 0.8628032, 0.7934708, 0.8974694,
        0.7341, 1.353, 2.8981231, 1.2079008
      ],
      markPoint: {
        data: [
          { type: 'max', name: 'Max' },
          { type: 'min', name: 'Min' }
        ]
      },
      markLine: {
        data: [{ type: 'average', name: 'Avg' }]
      }
    },
    {
      name: '亚硝氮（mg/L）',
      type: 'line',
      data: [
        3.2004, 0.15, 0.079, 0.075, 0.068, 1.0668, 1.0668, 2.1336, 0.005, 0.001,
        0.001, 0.949, 0.091, 0.075, 0.069, 0.004, 0.019, 0.03, 0.073, 0.064,
        0.046, 0.004, 0.007, 0.007, 0.01, 0.01, 0.414, 0.071, 0.367, 0.01, 0.01,
        0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 24.5364, 2.667, 4.5339, 0.001,
        0.001, 0.012, 0.01, 0.01, 0.01, 0.008, 0.001, 0.002, 0.077, 0.065,
        0.037, 1.3335, 169.0878, 20.2692, 0.744, 0.643, 0.741, 0.014, 0.132,
        0.016, 0.103, 0.013, 0.008, 0.741, 0.601, 0.757, 43.7388, 1.3335,
        1.0668, 2.667, 2.1336, 274.1676, 0.132, 0.003, 0.005, 0.003, 0.01, 0.01,
        0.059, 0.047
      ],
      markPoint: {
        data: [{ name: '周最低', value: -2, xAxis: 1, yAxis: -1.5 }]
      },
      markLine: {
        data: [
          { type: 'average', name: 'Avg' },
          [
            {
              symbol: 'none',
              x: '90%',
              yAxis: 'max'
            },
            {
              symbol: 'circle',
              label: {
                position: 'start',
                formatter: 'Max'
              },
              type: 'max',
              name: '最高点'
            }
          ]
        ]
      }
    }
  ]
};

option && myChart.setOption(option);

  window.addEventListener("resize", function() {
    myChart.resize();
  });
  
})();
// 折线图 优秀作品--------------------------------------------------------------------------------------------------------
(function() {
  // 基于准备好的dom，初始化echarts实例
  var myChart = echarts.init(document.querySelector(".pie1 .chart"));

  option = {

  };

  // 使用刚指定的配置项和数据显示图表。
  myChart.setOption(option);
  window.addEventListener("resize", function() {
    myChart.resize();
  });
})();

// 点位分布统计模块-----------------------------------------------------------------------------------------------------------
(function() {
  // 1. 实例化对象
  var myChart = echarts.init(document.querySelector(".pie1 .chart"));

  // 2. 指定配置项和数据
  
  var option = {
    tooltip: {
      trigger: 'item',
      axisPointer: {
        lineStyle: {
          color: "#dddc6b"
        }
      }
    },
    legend: {
      top: "0%",
      textStyle: {
        color: "rgba(255,255,255,.5)",
        fontSize: "12"
      }
    },
    grid: {
      left: "10",
      top: "30",
      right: "10",
      bottom: "10",
      containLabel: true
    },

    xAxis: [
      {
        type: "category",
        boundaryGap: false,
        axisLabel: {
          textStyle: {
            color: "rgba(255,255,255,.6)",
            fontSize: 12
          }
        },
        axisLine: {
          lineStyle: {
            color: "rgba(255,255,255,.2)"
          }
        },

        
      },
   
    ],

    yAxis: [
      {
        type: "value",
        axisTick: { show: false },
        axisLine: {
          lineStyle: {
            color: "rgba(255,255,255,.1)"
          }
        },
        axisLabel: {
          textStyle: {
            color: "rgba(255,255,255,.6)",
            fontSize: 12
          }
        },

        splitLine: {
          lineStyle: {
            color: "rgba(255,255,255,.1)"
          }
        }
      }
    ],
  title: [
    {
      subtext: '主要农业活动',
      left: '16.67%',
      top: '65%',
      textAlign: 'center'
    },
    {
      subtext: '施肥方式',
      left: '50%',
      top: '65%',
      textAlign: 'center'
    },
    {
      subtext: '养殖粪尿处理',
      left: '83.33%',
      top: '65%',
      textAlign: 'center'
    }
  ],
  series: [
    {
      type: 'pie',
      radius: '50%',
      center: ['55%', '50%'],
      data: [
        { name: '种植业', value: 68.65 },
        { name: '畜禽养殖业', value: 24.7 },
        { name: '水产养殖', value: 8.69 },
        { name: '其他', value: 27.94 }
      ],
      label: {
        show: false,
        position: 'outer',
        bleedMargin: 1
      },
      left: 0,
      right: '66.6667%',
      top: 0,
      bottom: 0
    },
    {
      type: 'pie',
      radius: '50%',
      center: ['50%', '50%'],
      data: [
        { name: '撒施', value: 64.74 },
        { name: '深施', value: 35.6 },
        { name: '叶面喷施', value: 18.23 }
      ],
      label: {
        show: false,
        position: 'outer',
        bleedMargin: 1
      },
     
      left: '33.3333%',
      right: '33.3333%' ,
      top: 0,
      bottom: 0
    },
    {
      type: 'pie',
      radius: '50%',
      center: ['50%', '50%'],
      data: [
        { name: '丢弃', value: 16.87 },
        { name: '堆肥', value: 53.83 },
        { name: '沼气池', value: 22.49 },
        { name: '其他', value: 31.18 }
      ],
      label: {
        show: false,
        position: 'outer',
        margin: 1
      },
      left: '66.6667%',
      right: 0,
      top: 0,
      bottom: 0
    }
  ]
};

  
  // 3. 配置项和数据给我们的实例化对象
  myChart.setOption(option);
  // 4. 当我们浏览器缩放的时候，图表也等比例缩放
  window.addEventListener("resize", function() {
    // 让我们的图表调用 resize这个方法
    myChart.resize();
  });
})();
